#include<stdio.h>
int main()
{
    //除法
    printf("%d \n", 10/2);

    //取余
    printf("%d \n", 10 % 3);//余数为1
    printf("%d \n", 179 / 10);

    //细节
    //1.整数计算，结果是一定是一个整数
    printf("%d \n",10 / 3); //结果是3
    printf("%lf \n",10 / 3); //结果是0.00..

    //2.小数计算，结果一定是一个小数
    printf("%lf \n",10.1 + 2.4);  //结果是12.5
    printf("%lf \n",10.0 / 3.0);  //结果是3.333333
    
    //3.整数与小数混合计算，结果是一个小数
    printf("%lf \n",10 + 2.1);
    printf("%lf \n",10 / 3.0); //结果是3.333333

    //4.小数直接参与计算，结果可能不精确
    printf("%.20lf \n",10.0 / 3.0);//输出：3.33333333333333348136
    

    //5.除法的细节
    //printf("%d \n", 10 / 0 );  0不能被除

    //取余的细节
    //1.运算的数据必须是整数
    //2.获取余数地正负，是与第一个数字保持一致的
    printf("%d \n", 10 % 3);  //结果是1
    printf("%d \n", -10 % 3);  //结果是-1
    printf("%d \n", 10 % -3);   //结果是1
    
    return 0;
}